app/controllers/pages_controller.rb

   def welcome
 	@posts = Post.all
---
SELECT "posts".* FROM "posts"